IZakirov2/src/Documents/ПриходнаяНакладная/ПриходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходнаяНакладная</name>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдИзм</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

IZakirov2/src/InformationRegisters/УчетнаяПолитика/УчетнаяПолитика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитика</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>МетодСписания</name>
    <type>
      <types>EnumRef.МетодыСписанияУчетнойПолитики</types>
    </type>
  </resources>
</mdclass:InformationRegister>

IZakirov2/src/AccumulationRegisters/ОстаткиНоменклатуры/ОстаткиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиНоменклатуры</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмеренияНоменклатуры</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

IZakirov2/src/Enums/МетодыСписанияУчетнойПолитики/МетодыСписанияУчетнойПолитики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МетодыСписанияУчетнойПолитики</name>
  <enumValues>
    <name>FIFO</name>
  </enumValues>
  <enumValues>
    <name>ПоСреднейСебестоимости</name>
  </enumValues>
</mdclass:Enum>

IZakirov2/src/Documents/ПриходнаяНакладная/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	МетодСписания = РегистрыСведений.УчетнаяПолитика.ПолучитьПоследнее(Дата).МетодСписания;
	
	
	
	
	Если МетодСписания.Пустая() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Учетная политика не определена!";
		Сообщение.Сообщить();
		
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если МетодСписания = Перечисления.МетодыСписанияУчетнойПолитики.FIFO Тогда
		// регистр ОстаткиНоменклатуры Приход
		Движения.ОстаткиНоменклатуры.Записывать = Истина;
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			Движение = Движения.ОстаткиНоменклатуры.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Партия = ЭтотОбъект.Ссылка;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.ЕдиницаИзмеренияНоменклатуры = ТекСтрокаТовары.ЕдИзм;
			Движение.Количество = ТекСтрокаТовары.Количество;
			Движение.Стоимость =  ТекСтрокаТовары.Цена;
			Движение.Сумма = ТекСтрокаТовары.Сумма;
		КонецЦикла;
		
	Иначе 
		Если МетодСписания = Перечисления.МетодыСписанияУчетнойПолитики.ПоСреднейСебестоимости Тогда
			Движения.ОстаткиНоменклатуры.Записывать = Истина;
			Для Каждого ТекСтрокаТовары Из Товары Цикл
				Движение = Движения.ОстаткиНоменклатуры.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Партия = Документы.ПриходнаяНакладная.ПустаяСсылка();
				Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
				Движение.ЕдиницаИзмеренияНоменклатуры = ТекСтрокаТовары.ЕдИзм;
				Движение.Количество = ТекСтрокаТовары.Количество;
				Движение.Стоимость =  ТекСтрокаТовары.Цена;
				Движение.Сумма = ТекСтрокаТовары.Сумма;
			КонецЦикла;
			
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
